# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BindingMap..::..Clear Method
BindingMap Class See Also
---
This method is used to remove all the items in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override void Clear()
```

Visual Basic
---
```text
Public Overrides Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear() override
```

# Remarks
The method Clear inherited from base class is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.
# See Also
BindingMap Class
Autodesk.Revit.DB Namespace